app/controllers/tutorials_controller.rb

  def index
    @tutorials = Tutorial.all
---
SELECT "tutorials".* FROM "tutorials"

  def create
    @tutorial = current_user.tutorials.build(tutorial_params)
    @user = current_user

    respond_to do |format|
      if @tutorial.save
---
INSERT INTO "tutorials" ("title", "tagline", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["tagline", ""], ["content", ""], ["created_at", "2016-04-15 20:23:22.412954"], ["updated_at", "2016-04-15 20:23:22.412954"]]

    def set_tutorial
      @tutorial = Tutorial.find(params[:id])
---
SELECT  "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = ? LIMIT 1  [["id", 1]]